perf-results/scenario7-write-ceiling.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/write-ceiling.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m30s max duration (incl. graceful stop):
              * ramp_writers: Up to 50 looping VUs for 4m0s over 8 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
ramp_writers   [   0% ] 01/50 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
ramp_writers   [   1% ] 01/50 VUs  0m02.0s/4m00.0s

running (0m03.0s), 01/50 VUs, 3 complete and 0 interrupted iterations
ramp_writers   [   1% ] 01/50 VUs  0m03.0s/4m00.0s

running (0m04.0s), 01/50 VUs, 5 complete and 0 interrupted iterations
ramp_writers   [   2% ] 01/50 VUs  0m04.0s/4m00.0s

running (0m05.0s), 01/50 VUs, 6 complete and 0 interrupted iterations
ramp_writers   [   2% ] 01/50 VUs  0m05.0s/4m00.0s

running (0m06.0s), 01/50 VUs, 7 complete and 0 interrupted iterations
ramp_writers   [   2% ] 01/50 VUs  0m06.0s/4m00.0s

running (0m07.0s), 01/50 VUs, 9 complete and 0 interrupted iterations
ramp_writers   [   3% ] 01/50 VUs  0m07.0s/4m00.0s

running (0m08.0s), 02/50 VUs, 10 complete and 0 interrupted iterations
ramp_writers   [   3% ] 02/50 VUs  0m08.0s/4m00.0s

running (0m09.0s), 02/50 VUs, 13 complete and 0 interrupted iterations
ramp_writers   [   4% ] 02/50 VUs  0m09.0s/4m00.0s

running (0m10.0s), 02/50 VUs, 15 complete and 0 interrupted iterations
ramp_writers   [   4% ] 02/50 VUs  0m10.0s/4m00.0s

running (0m11.0s), 02/50 VUs, 18 complete and 0 interrupted iterations
ramp_writers   [   5% ] 02/50 VUs  0m11.0s/4m00.0s

running (0m12.0s), 02/50 VUs, 21 complete and 0 interrupted iterations
ramp_writers   [   5% ] 02/50 VUs  0m12.0s/4m00.0s

running (0m13.0s), 02/50 VUs, 24 complete and 0 interrupted iterations
ramp_writers   [   5% ] 02/50 VUs  0m13.0s/4m00.0s

running (0m14.0s), 02/50 VUs, 27 complete and 0 interrupted iterations
ramp_writers   [   6% ] 02/50 VUs  0m14.0s/4m00.0s

running (0m15.0s), 02/50 VUs, 29 complete and 0 interrupted iterations
ramp_writers   [   6% ] 02/50 VUs  0m15.0s/4m00.0s

running (0m16.0s), 03/50 VUs, 33 complete and 0 interrupted iterations
ramp_writers   [   7% ] 03/50 VUs  0m16.0s/4m00.0s

running (0m17.0s), 03/50 VUs, 38 complete and 0 interrupted iterations
ramp_writers   [   7% ] 03/50 VUs  0m17.0s/4m00.0s

running (0m18.0s), 03/50 VUs, 41 complete and 0 interrupted iterations
ramp_writers   [   7% ] 03/50 VUs  0m18.0s/4m00.0s

running (0m19.0s), 03/50 VUs, 46 complete and 0 interrupted iterations
ramp_writers   [   8% ] 03/50 VUs  0m19.0s/4m00.0s

running (0m20.0s), 03/50 VUs, 50 complete and 0 interrupted iterations
ramp_writers   [   8% ] 03/50 VUs  0m20.0s/4m00.0s

running (0m21.0s), 03/50 VUs, 53 complete and 0 interrupted iterations
ramp_writers   [   9% ] 03/50 VUs  0m21.0s/4m00.0s

running (0m22.0s), 03/50 VUs, 57 complete and 0 interrupted iterations
ramp_writers   [   9% ] 03/50 VUs  0m22.0s/4m00.0s

running (0m23.0s), 04/50 VUs, 62 complete and 0 interrupted iterations
ramp_writers   [  10% ] 04/50 VUs  0m23.0s/4m00.0s

running (0m24.0s), 04/50 VUs, 67 complete and 0 interrupted iterations
ramp_writers   [  10% ] 04/50 VUs  0m24.0s/4m00.0s

running (0m25.0s), 04/50 VUs, 72 complete and 0 interrupted iterations
ramp_writers   [  10% ] 04/50 VUs  0m25.0s/4m00.0s

running (0m26.0s), 04/50 VUs, 77 complete and 0 interrupted iterations
ramp_writers   [  11% ] 04/50 VUs  0m26.0s/4m00.0s

running (0m27.0s), 04/50 VUs, 84 complete and 0 interrupted iterations
ramp_writers   [  11% ] 04/50 VUs  0m27.0s/4m00.0s

running (0m28.0s), 04/50 VUs, 89 complete and 0 interrupted iterations
ramp_writers   [  12% ] 04/50 VUs  0m28.0s/4m00.0s

running (0m29.0s), 04/50 VUs, 95 complete and 0 interrupted iterations
ramp_writers   [  12% ] 04/50 VUs  0m29.0s/4m00.0s

running (0m30.0s), 04/50 VUs, 101 complete and 0 interrupted iterations
ramp_writers   [  12% ] 04/50 VUs  0m30.0s/4m00.0s

running (0m31.0s), 05/50 VUs, 108 complete and 0 interrupted iterations
ramp_writers   [  13% ] 05/50 VUs  0m31.0s/4m00.0s

running (0m32.0s), 05/50 VUs, 114 complete and 0 interrupted iterations
ramp_writers   [  13% ] 05/50 VUs  0m32.0s/4m00.0s

running (0m33.0s), 05/50 VUs, 123 complete and 0 interrupted iterations
ramp_writers   [  14% ] 05/50 VUs  0m33.0s/4m00.0s

running (0m34.0s), 05/50 VUs, 128 complete and 0 interrupted iterations
ramp_writers   [  14% ] 05/50 VUs  0m34.0s/4m00.0s

running (0m35.0s), 05/50 VUs, 138 complete and 0 interrupted iterations
ramp_writers   [  15% ] 05/50 VUs  0m35.0s/4m00.0s

running (0m36.0s), 05/50 VUs, 143 complete and 0 interrupted iterations
ramp_writers   [  15% ] 05/50 VUs  0m36.0s/4m00.0s

running (0m37.0s), 06/50 VUs, 149 complete and 0 interrupted iterations
ramp_writers   [  15% ] 06/50 VUs  0m37.0s/4m00.0s

running (0m38.0s), 06/50 VUs, 156 complete and 0 interrupted iterations
ramp_writers   [  16% ] 06/50 VUs  0m38.0s/4m00.0s

running (0m39.0s), 06/50 VUs, 165 complete and 0 interrupted iterations
ramp_writers   [  16% ] 06/50 VUs  0m39.0s/4m00.0s

running (0m40.0s), 06/50 VUs, 173 complete and 0 interrupted iterations
ramp_writers   [  17% ] 06/50 VUs  0m40.0s/4m00.0s

running (0m41.0s), 06/50 VUs, 180 complete and 0 interrupted iterations
ramp_writers   [  17% ] 06/50 VUs  0m41.0s/4m00.0s

running (0m42.0s), 06/50 VUs, 189 complete and 0 interrupted iterations
ramp_writers   [  17% ] 06/50 VUs  0m42.0s/4m00.0s

running (0m43.0s), 07/50 VUs, 197 complete and 0 interrupted iterations
ramp_writers   [  18% ] 07/50 VUs  0m43.0s/4m00.0s

running (0m44.0s), 07/50 VUs, 206 complete and 0 interrupted iterations
ramp_writers   [  18% ] 07/50 VUs  0m44.0s/4m00.0s

running (0m45.0s), 07/50 VUs, 215 complete and 0 interrupted iterations
ramp_writers   [  19% ] 07/50 VUs  0m45.0s/4m00.0s

running (0m46.0s), 07/50 VUs, 223 complete and 0 interrupted iterations
ramp_writers   [  19% ] 07/50 VUs  0m46.0s/4m00.0s

running (0m47.0s), 07/50 VUs, 234 complete and 0 interrupted iterations
ramp_writers   [  20% ] 07/50 VUs  0m47.0s/4m00.0s

running (0m48.0s), 07/50 VUs, 242 complete and 0 interrupted iterations
ramp_writers   [  20% ] 07/50 VUs  0m48.0s/4m00.0s

running (0m49.0s), 08/50 VUs, 252 complete and 0 interrupted iterations
ramp_writers   [  20% ] 08/50 VUs  0m49.0s/4m00.0s

running (0m50.0s), 08/50 VUs, 262 complete and 0 interrupted iterations
ramp_writers   [  21% ] 08/50 VUs  0m50.0s/4m00.0s

running (0m51.0s), 08/50 VUs, 272 complete and 0 interrupted iterations
ramp_writers   [  21% ] 08/50 VUs  0m51.0s/4m00.0s

running (0m52.0s), 08/50 VUs, 282 complete and 0 interrupted iterations
ramp_writers   [  22% ] 08/50 VUs  0m52.0s/4m00.0s

running (0m53.0s), 08/50 VUs, 293 complete and 0 interrupted iterations
ramp_writers   [  22% ] 08/50 VUs  0m53.0s/4m00.0s

running (0m54.0s), 08/50 VUs, 303 complete and 0 interrupted iterations
ramp_writers   [  22% ] 08/50 VUs  0m54.0s/4m00.0s

running (0m55.0s), 09/50 VUs, 313 complete and 0 interrupted iterations
ramp_writers   [  23% ] 09/50 VUs  0m55.0s/4m00.0s

running (0m56.0s), 09/50 VUs, 325 complete and 0 interrupted iterations
ramp_writers   [  23% ] 09/50 VUs  0m56.0s/4m00.0s

running (0m57.0s), 09/50 VUs, 337 complete and 0 interrupted iterations
ramp_writers   [  24% ] 09/50 VUs  0m57.0s/4m00.0s

running (0m58.0s), 09/50 VUs, 347 complete and 0 interrupted iterations
ramp_writers   [  24% ] 09/50 VUs  0m58.0s/4m00.0s

running (0m59.0s), 09/50 VUs, 357 complete and 0 interrupted iterations
ramp_writers   [  25% ] 09/50 VUs  0m59.0s/4m00.0s

running (1m00.0s), 09/50 VUs, 369 complete and 0 interrupted iterations
ramp_writers   [  25% ] 09/50 VUs  1m00.0s/4m00.0s

running (1m01.0s), 10/50 VUs, 381 complete and 0 interrupted iterations
ramp_writers   [  25% ] 10/50 VUs  1m01.0s/4m00.0s

running (1m02.0s), 10/50 VUs, 395 complete and 0 interrupted iterations
ramp_writers   [  26% ] 10/50 VUs  1m02.0s/4m00.0s

running (1m03.0s), 10/50 VUs, 405 complete and 0 interrupted iterations
ramp_writers   [  26% ] 10/50 VUs  1m03.0s/4m00.0s

running (1m04.0s), 10/50 VUs, 421 complete and 0 interrupted iterations
ramp_writers   [  27% ] 10/50 VUs  1m04.0s/4m00.0s

running (1m05.0s), 10/50 VUs, 432 complete and 0 interrupted iterations
ramp_writers   [  27% ] 10/50 VUs  1m05.0s/4m00.0s

running (1m06.0s), 10/50 VUs, 447 complete and 0 interrupted iterations
ramp_writers   [  27% ] 10/50 VUs  1m06.0s/4m00.0s

running (1m07.0s), 11/50 VUs, 464 complete and 0 interrupted iterations
ramp_writers   [  28% ] 11/50 VUs  1m07.0s/4m00.0s

running (1m08.0s), 11/50 VUs, 477 complete and 0 interrupted iterations
ramp_writers   [  28% ] 11/50 VUs  1m08.0s/4m00.0s

running (1m09.0s), 11/50 VUs, 490 complete and 0 interrupted iterations
ramp_writers   [  29% ] 11/50 VUs  1m09.0s/4m00.0s

running (1m10.0s), 11/50 VUs, 505 complete and 0 interrupted iterations
ramp_writers   [  29% ] 11/50 VUs  1m10.0s/4m00.0s

running (1m11.0s), 11/50 VUs, 520 complete and 0 interrupted iterations
ramp_writers   [  30% ] 11/50 VUs  1m11.0s/4m00.0s

running (1m12.0s), 11/50 VUs, 532 complete and 0 interrupted iterations
ramp_writers   [  30% ] 11/50 VUs  1m12.0s/4m00.0s

running (1m13.0s), 12/50 VUs, 548 complete and 0 interrupted iterations
ramp_writers   [  30% ] 12/50 VUs  1m13.0s/4m00.0s

running (1m14.0s), 12/50 VUs, 561 complete and 0 interrupted iterations
ramp_writers   [  31% ] 12/50 VUs  1m14.0s/4m00.0s

running (1m15.0s), 12/50 VUs, 577 complete and 0 interrupted iterations
ramp_writers   [  31% ] 12/50 VUs  1m15.0s/4m00.0s

running (1m16.0s), 12/50 VUs, 594 complete and 0 interrupted iterations
ramp_writers   [  32% ] 12/50 VUs  1m16.0s/4m00.0s

running (1m17.0s), 12/50 VUs, 610 complete and 0 interrupted iterations
ramp_writers   [  32% ] 12/50 VUs  1m17.0s/4m00.0s

running (1m18.0s), 12/50 VUs, 622 complete and 0 interrupted iterations
ramp_writers   [  32% ] 12/50 VUs  1m18.0s/4m00.0s

running (1m19.0s), 13/50 VUs, 640 complete and 0 interrupted iterations
ramp_writers   [  33% ] 13/50 VUs  1m19.0s/4m00.0s

running (1m20.0s), 13/50 VUs, 657 complete and 0 interrupted iterations
ramp_writers   [  33% ] 13/50 VUs  1m20.0s/4m00.0s

running (1m21.0s), 13/50 VUs, 673 complete and 0 interrupted iterations
ramp_writers   [  34% ] 13/50 VUs  1m21.0s/4m00.0s

running (1m22.0s), 13/50 VUs, 691 complete and 0 interrupted iterations
ramp_writers   [  34% ] 13/50 VUs  1m22.0s/4m00.0s

running (1m23.0s), 13/50 VUs, 706 complete and 0 interrupted iterations
ramp_writers   [  35% ] 13/50 VUs  1m23.0s/4m00.0s

running (1m24.0s), 13/50 VUs, 720 complete and 0 interrupted iterations
ramp_writers   [  35% ] 13/50 VUs  1m24.0s/4m00.0s

running (1m25.0s), 14/50 VUs, 726 complete and 0 interrupted iterations
ramp_writers   [  35% ] 14/50 VUs  1m25.0s/4m00.0s

running (1m26.0s), 14/50 VUs, 744 complete and 0 interrupted iterations
ramp_writers   [  36% ] 14/50 VUs  1m26.0s/4m00.0s

running (1m27.0s), 14/50 VUs, 762 complete and 0 interrupted iterations
ramp_writers   [  36% ] 14/50 VUs  1m27.0s/4m00.0s

running (1m28.0s), 14/50 VUs, 782 complete and 0 interrupted iterations
ramp_writers   [  37% ] 14/50 VUs  1m28.0s/4m00.0s

running (1m29.0s), 14/50 VUs, 798 complete and 0 interrupted iterations
ramp_writers   [  37% ] 14/50 VUs  1m29.0s/4m00.0s

running (1m30.0s), 14/50 VUs, 813 complete and 0 interrupted iterations
ramp_writers   [  37% ] 14/50 VUs  1m30.0s/4m00.0s

running (1m31.0s), 15/50 VUs, 832 complete and 0 interrupted iterations
ramp_writers   [  38% ] 15/50 VUs  1m31.0s/4m00.0s

running (1m32.0s), 15/50 VUs, 851 complete and 0 interrupted iterations
ramp_writers   [  38% ] 15/50 VUs  1m32.0s/4m00.0s

running (1m33.0s), 15/50 VUs, 869 complete and 0 interrupted iterations
ramp_writers   [  39% ] 15/50 VUs  1m33.0s/4m00.0s

running (1m34.0s), 15/50 VUs, 889 complete and 0 interrupted iterations
ramp_writers   [  39% ] 15/50 VUs  1m34.0s/4m00.0s

running (1m35.0s), 15/50 VUs, 907 complete and 0 interrupted iterations
ramp_writers   [  40% ] 15/50 VUs  1m35.0s/4m00.0s

running (1m36.0s), 15/50 VUs, 926 complete and 0 interrupted iterations
ramp_writers   [  40% ] 15/50 VUs  1m36.0s/4m00.0s

running (1m37.0s), 16/50 VUs, 945 complete and 0 interrupted iterations
ramp_writers   [  40% ] 16/50 VUs  1m37.0s/4m00.0s

running (1m38.0s), 16/50 VUs, 964 complete and 0 interrupted iterations
ramp_writers   [  41% ] 16/50 VUs  1m38.0s/4m00.0s

running (1m39.0s), 16/50 VUs, 984 complete and 0 interrupted iterations
ramp_writers   [  41% ] 16/50 VUs  1m39.0s/4m00.0s

running (1m40.0s), 16/50 VUs, 1006 complete and 0 interrupted iterations
ramp_writers   [  42% ] 16/50 VUs  1m40.0s/4m00.0s

running (1m41.0s), 16/50 VUs, 1026 complete and 0 interrupted iterations
ramp_writers   [  42% ] 16/50 VUs  1m41.0s/4m00.0s

running (1m42.0s), 16/50 VUs, 1045 complete and 0 interrupted iterations
ramp_writers   [  42% ] 16/50 VUs  1m42.0s/4m00.0s

running (1m43.0s), 17/50 VUs, 1064 complete and 0 interrupted iterations
ramp_writers   [  43% ] 17/50 VUs  1m43.0s/4m00.0s

running (1m44.0s), 17/50 VUs, 1085 complete and 0 interrupted iterations
ramp_writers   [  43% ] 17/50 VUs  1m44.0s/4m00.0s

running (1m45.0s), 17/50 VUs, 1104 complete and 0 interrupted iterations
ramp_writers   [  44% ] 17/50 VUs  1m45.0s/4m00.0s

running (1m46.0s), 17/50 VUs, 1126 complete and 0 interrupted iterations
ramp_writers   [  44% ] 17/50 VUs  1m46.0s/4m00.0s

running (1m47.0s), 17/50 VUs, 1144 complete and 0 interrupted iterations
ramp_writers   [  45% ] 17/50 VUs  1m47.0s/4m00.0s

running (1m48.0s), 17/50 VUs, 1168 complete and 0 interrupted iterations
ramp_writers   [  45% ] 17/50 VUs  1m48.0s/4m00.0s

running (1m49.0s), 18/50 VUs, 1190 complete and 0 interrupted iterations
ramp_writers   [  45% ] 18/50 VUs  1m49.0s/4m00.0s

running (1m50.0s), 18/50 VUs, 1209 complete and 0 interrupted iterations
ramp_writers   [  46% ] 18/50 VUs  1m50.0s/4m00.0s

running (1m51.0s), 18/50 VUs, 1230 complete and 0 interrupted iterations
ramp_writers   [  46% ] 18/50 VUs  1m51.0s/4m00.0s

running (1m52.0s), 18/50 VUs, 1250 complete and 0 interrupted iterations
ramp_writers   [  47% ] 18/50 VUs  1m52.0s/4m00.0s

running (1m53.0s), 18/50 VUs, 1273 complete and 0 interrupted iterations
ramp_writers   [  47% ] 18/50 VUs  1m53.0s/4m00.0s

running (1m54.0s), 18/50 VUs, 1293 complete and 0 interrupted iterations
ramp_writers   [  47% ] 18/50 VUs  1m54.0s/4m00.0s

running (1m55.0s), 19/50 VUs, 1313 complete and 0 interrupted iterations
ramp_writers   [  48% ] 19/50 VUs  1m55.0s/4m00.0s

running (1m56.0s), 19/50 VUs, 1336 complete and 0 interrupted iterations
ramp_writers   [  48% ] 19/50 VUs  1m56.0s/4m00.0s

running (1m57.0s), 19/50 VUs, 1357 complete and 0 interrupted iterations
ramp_writers   [  49% ] 19/50 VUs  1m57.0s/4m00.0s

running (1m58.0s), 19/50 VUs, 1380 complete and 0 interrupted iterations
ramp_writers   [  49% ] 19/50 VUs  1m58.0s/4m00.0s

running (1m59.0s), 19/50 VUs, 1401 complete and 0 interrupted iterations
ramp_writers   [  50% ] 19/50 VUs  1m59.0s/4m00.0s

running (2m00.0s), 19/50 VUs, 1424 complete and 0 interrupted iterations
ramp_writers   [  50% ] 19/50 VUs  2m00.0s/4m00.0s

running (2m01.0s), 20/50 VUs, 1446 complete and 0 interrupted iterations
ramp_writers   [  50% ] 20/50 VUs  2m01.0s/4m00.0s

running (2m02.0s), 20/50 VUs, 1468 complete and 0 interrupted iterations
ramp_writers   [  51% ] 20/50 VUs  2m02.0s/4m00.0s

running (2m03.0s), 20/50 VUs, 1493 complete and 0 interrupted iterations
ramp_writers   [  51% ] 20/50 VUs  2m03.0s/4m00.0s

running (2m04.0s), 21/50 VUs, 1517 complete and 0 interrupted iterations
ramp_writers   [  52% ] 21/50 VUs  2m04.0s/4m00.0s

running (2m05.0s), 21/50 VUs, 1541 complete and 0 interrupted iterations
ramp_writers   [  52% ] 21/50 VUs  2m05.0s/4m00.0s

running (2m06.0s), 21/50 VUs, 1564 complete and 0 interrupted iterations
ramp_writers   [  52% ] 21/50 VUs  2m06.0s/4m00.0s

running (2m07.0s), 22/50 VUs, 1590 complete and 0 interrupted iterations
ramp_writers   [  53% ] 22/50 VUs  2m07.0s/4m00.0s

running (2m08.0s), 22/50 VUs, 1614 complete and 0 interrupted iterations
ramp_writers   [  53% ] 22/50 VUs  2m08.0s/4m00.0s

running (2m09.0s), 22/50 VUs, 1638 complete and 0 interrupted iterations
ramp_writers   [  54% ] 22/50 VUs  2m09.0s/4m00.0s

running (2m10.0s), 23/50 VUs, 1663 complete and 0 interrupted iterations
ramp_writers   [  54% ] 23/50 VUs  2m10.0s/4m00.0s

running (2m11.0s), 23/50 VUs, 1690 complete and 0 interrupted iterations
ramp_writers   [  55% ] 23/50 VUs  2m11.0s/4m00.0s

running (2m12.0s), 23/50 VUs, 1714 complete and 0 interrupted iterations
ramp_writers   [  55% ] 23/50 VUs  2m12.0s/4m00.0s

running (2m13.0s), 24/50 VUs, 1739 complete and 0 interrupted iterations
ramp_writers   [  55% ] 24/50 VUs  2m13.0s/4m00.0s

running (2m14.0s), 24/50 VUs, 1769 complete and 0 interrupted iterations
ramp_writers   [  56% ] 24/50 VUs  2m14.0s/4m00.0s

running (2m15.0s), 24/50 VUs, 1792 complete and 0 interrupted iterations
ramp_writers   [  56% ] 24/50 VUs  2m15.0s/4m00.0s

running (2m16.0s), 25/50 VUs, 1820 complete and 0 interrupted iterations
ramp_writers   [  57% ] 25/50 VUs  2m16.0s/4m00.0s

running (2m17.0s), 25/50 VUs, 1849 complete and 0 interrupted iterations
ramp_writers   [  57% ] 25/50 VUs  2m17.0s/4m00.0s

running (2m18.0s), 25/50 VUs, 1875 complete and 0 interrupted iterations
ramp_writers   [  57% ] 25/50 VUs  2m18.0s/4m00.0s

running (2m19.0s), 26/50 VUs, 1905 complete and 0 interrupted iterations
ramp_writers   [  58% ] 26/50 VUs  2m19.0s/4m00.0s

running (2m20.0s), 26/50 VUs, 1936 complete and 0 interrupted iterations
ramp_writers   [  58% ] 26/50 VUs  2m20.0s/4m00.0s

running (2m21.0s), 26/50 VUs, 1964 complete and 0 interrupted iterations
ramp_writers   [  59% ] 26/50 VUs  2m21.0s/4m00.0s

running (2m22.0s), 27/50 VUs, 1987 complete and 0 interrupted iterations
ramp_writers   [  59% ] 27/50 VUs  2m22.0s/4m00.0s

running (2m23.0s), 27/50 VUs, 2014 complete and 0 interrupted iterations
ramp_writers   [  60% ] 27/50 VUs  2m23.0s/4m00.0s

running (2m24.0s), 27/50 VUs, 2042 complete and 0 interrupted iterations
ramp_writers   [  60% ] 27/50 VUs  2m24.0s/4m00.0s

running (2m25.0s), 28/50 VUs, 2073 complete and 0 interrupted iterations
ramp_writers   [  60% ] 28/50 VUs  2m25.0s/4m00.0s

running (2m26.0s), 28/50 VUs, 2105 complete and 0 interrupted iterations
ramp_writers   [  61% ] 28/50 VUs  2m26.0s/4m00.0s

running (2m27.0s), 28/50 VUs, 2137 complete and 0 interrupted iterations
ramp_writers   [  61% ] 28/50 VUs  2m27.0s/4m00.0s

running (2m28.0s), 29/50 VUs, 2173 complete and 0 interrupted iterations
ramp_writers   [  62% ] 29/50 VUs  2m28.0s/4m00.0s

running (2m29.0s), 29/50 VUs, 2205 complete and 0 interrupted iterations
ramp_writers   [  62% ] 29/50 VUs  2m29.0s/4m00.0s

running (2m30.0s), 29/50 VUs, 2239 complete and 0 interrupted iterations
ramp_writers   [  62% ] 29/50 VUs  2m30.0s/4m00.0s

running (2m31.0s), 30/50 VUs, 2273 complete and 0 interrupted iterations
ramp_writers   [  63% ] 30/50 VUs  2m31.0s/4m00.0s

running (2m32.0s), 30/50 VUs, 2307 complete and 0 interrupted iterations
ramp_writers   [  63% ] 30/50 VUs  2m32.0s/4m00.0s

running (2m33.0s), 30/50 VUs, 2338 complete and 0 interrupted iterations
ramp_writers   [  64% ] 30/50 VUs  2m33.0s/4m00.0s

running (2m34.0s), 31/50 VUs, 2374 complete and 0 interrupted iterations
ramp_writers   [  64% ] 31/50 VUs  2m34.0s/4m00.0s

running (2m35.0s), 31/50 VUs, 2380 complete and 0 interrupted iterations
ramp_writers   [  65% ] 31/50 VUs  2m35.0s/4m00.0s

running (2m36.0s), 31/50 VUs, 2414 complete and 0 interrupted iterations
ramp_writers   [  65% ] 31/50 VUs  2m36.0s/4m00.0s

running (2m37.0s), 32/50 VUs, 2449 complete and 0 interrupted iterations
ramp_writers   [  65% ] 32/50 VUs  2m37.0s/4m00.0s

running (2m38.0s), 32/50 VUs, 2486 complete and 0 interrupted iterations
ramp_writers   [  66% ] 32/50 VUs  2m38.0s/4m00.0s

running (2m39.0s), 32/50 VUs, 2521 complete and 0 interrupted iterations
ramp_writers   [  66% ] 32/50 VUs  2m39.0s/4m00.0s

running (2m40.0s), 33/50 VUs, 2558 complete and 0 interrupted iterations
ramp_writers   [  67% ] 33/50 VUs  2m40.0s/4m00.0s

running (2m41.0s), 33/50 VUs, 2593 complete and 0 interrupted iterations
ramp_writers   [  67% ] 33/50 VUs  2m41.0s/4m00.0s

running (2m42.0s), 33/50 VUs, 2632 complete and 0 interrupted iterations
ramp_writers   [  67% ] 33/50 VUs  2m42.0s/4m00.0s

running (2m43.0s), 34/50 VUs, 2671 complete and 0 interrupted iterations
ramp_writers   [  68% ] 34/50 VUs  2m43.0s/4m00.0s

running (2m44.0s), 34/50 VUs, 2708 complete and 0 interrupted iterations
ramp_writers   [  68% ] 34/50 VUs  2m44.0s/4m00.0s

running (2m45.0s), 34/50 VUs, 2743 complete and 0 interrupted iterations
ramp_writers   [  69% ] 34/50 VUs  2m45.0s/4m00.0s

running (2m46.0s), 35/50 VUs, 2780 complete and 0 interrupted iterations
ramp_writers   [  69% ] 35/50 VUs  2m46.0s/4m00.0s

running (2m47.0s), 35/50 VUs, 2819 complete and 0 interrupted iterations
ramp_writers   [  70% ] 35/50 VUs  2m47.0s/4m00.0s

running (2m48.0s), 35/50 VUs, 2854 complete and 0 interrupted iterations
ramp_writers   [  70% ] 35/50 VUs  2m48.0s/4m00.0s

running (2m49.0s), 36/50 VUs, 2894 complete and 0 interrupted iterations
ramp_writers   [  70% ] 36/50 VUs  2m49.0s/4m00.0s

running (2m50.0s), 36/50 VUs, 2929 complete and 0 interrupted iterations
ramp_writers   [  71% ] 36/50 VUs  2m50.0s/4m00.0s

running (2m51.0s), 36/50 VUs, 2968 complete and 0 interrupted iterations
ramp_writers   [  71% ] 36/50 VUs  2m51.0s/4m00.0s

running (2m52.0s), 37/50 VUs, 3008 complete and 0 interrupted iterations
ramp_writers   [  72% ] 37/50 VUs  2m52.0s/4m00.0s

running (2m53.0s), 37/50 VUs, 3048 complete and 0 interrupted iterations
ramp_writers   [  72% ] 37/50 VUs  2m53.0s/4m00.0s

running (2m54.0s), 37/50 VUs, 3089 complete and 0 interrupted iterations
ramp_writers   [  72% ] 37/50 VUs  2m54.0s/4m00.0s

running (2m55.0s), 38/50 VUs, 3123 complete and 0 interrupted iterations
ramp_writers   [  73% ] 38/50 VUs  2m55.0s/4m00.0s

running (2m56.0s), 38/50 VUs, 3163 complete and 0 interrupted iterations
ramp_writers   [  73% ] 38/50 VUs  2m56.0s/4m00.0s

running (2m57.0s), 38/50 VUs, 3203 complete and 0 interrupted iterations
ramp_writers   [  74% ] 38/50 VUs  2m57.0s/4m00.0s

running (2m58.0s), 39/50 VUs, 3238 complete and 0 interrupted iterations
ramp_writers   [  74% ] 39/50 VUs  2m58.0s/4m00.0s

running (2m59.0s), 39/50 VUs, 3280 complete and 0 interrupted iterations
ramp_writers   [  75% ] 39/50 VUs  2m59.0s/4m00.0s

running (3m00.0s), 39/50 VUs, 3323 complete and 0 interrupted iterations
ramp_writers   [  75% ] 39/50 VUs  3m00.0s/4m00.0s

running (3m01.0s), 40/50 VUs, 3369 complete and 0 interrupted iterations
ramp_writers   [  75% ] 40/50 VUs  3m01.0s/4m00.0s

running (3m02.0s), 40/50 VUs, 3407 complete and 0 interrupted iterations
ramp_writers   [  76% ] 40/50 VUs  3m02.0s/4m00.0s

running (3m03.0s), 40/50 VUs, 3439 complete and 0 interrupted iterations
ramp_writers   [  76% ] 40/50 VUs  3m03.0s/4m00.0s

running (3m04.0s), 41/50 VUs, 3472 complete and 0 interrupted iterations
ramp_writers   [  77% ] 41/50 VUs  3m04.0s/4m00.0s

running (3m05.0s), 41/50 VUs, 3506 complete and 0 interrupted iterations
ramp_writers   [  77% ] 41/50 VUs  3m05.0s/4m00.0s

running (3m06.0s), 41/50 VUs, 3549 complete and 0 interrupted iterations
ramp_writers   [  77% ] 41/50 VUs  3m06.0s/4m00.0s

running (3m07.0s), 42/50 VUs, 3591 complete and 0 interrupted iterations
ramp_writers   [  78% ] 42/50 VUs  3m07.0s/4m00.0s

running (3m08.0s), 42/50 VUs, 3635 complete and 0 interrupted iterations
ramp_writers   [  78% ] 42/50 VUs  3m08.0s/4m00.0s

running (3m09.0s), 42/50 VUs, 3666 complete and 0 interrupted iterations
ramp_writers   [  79% ] 42/50 VUs  3m09.0s/4m00.0s

running (3m10.0s), 43/50 VUs, 3705 complete and 0 interrupted iterations
ramp_writers   [  79% ] 43/50 VUs  3m10.0s/4m00.0s

running (3m11.0s), 43/50 VUs, 3749 complete and 0 interrupted iterations
ramp_writers   [  80% ] 43/50 VUs  3m11.0s/4m00.0s

running (3m12.0s), 43/50 VUs, 3796 complete and 0 interrupted iterations
ramp_writers   [  80% ] 43/50 VUs  3m12.0s/4m00.0s

running (3m13.0s), 44/50 VUs, 3837 complete and 0 interrupted iterations
ramp_writers   [  80% ] 44/50 VUs  3m13.0s/4m00.0s

running (3m14.0s), 44/50 VUs, 3882 complete and 0 interrupted iterations
ramp_writers   [  81% ] 44/50 VUs  3m14.0s/4m00.0s

running (3m15.0s), 44/50 VUs, 3919 complete and 0 interrupted iterations
ramp_writers   [  81% ] 44/50 VUs  3m15.0s/4m00.0s

running (3m16.0s), 45/50 VUs, 3960 complete and 0 interrupted iterations
ramp_writers   [  82% ] 45/50 VUs  3m16.0s/4m00.0s

running (3m17.0s), 45/50 VUs, 4006 complete and 0 interrupted iterations
ramp_writers   [  82% ] 45/50 VUs  3m17.0s/4m00.0s

running (3m18.0s), 45/50 VUs, 4050 complete and 0 interrupted iterations
ramp_writers   [  82% ] 45/50 VUs  3m18.0s/4m00.0s

running (3m19.0s), 46/50 VUs, 4098 complete and 0 interrupted iterations
ramp_writers   [  83% ] 46/50 VUs  3m19.0s/4m00.0s

running (3m20.0s), 46/50 VUs, 4146 complete and 0 interrupted iterations
ramp_writers   [  83% ] 46/50 VUs  3m20.0s/4m00.0s

running (3m21.0s), 46/50 VUs, 4171 complete and 0 interrupted iterations
ramp_writers   [  84% ] 46/50 VUs  3m21.0s/4m00.0s

running (3m22.0s), 47/50 VUs, 4222 complete and 0 interrupted iterations
ramp_writers   [  84% ] 47/50 VUs  3m22.0s/4m00.0s

running (3m23.0s), 47/50 VUs, 4271 complete and 0 interrupted iterations
ramp_writers   [  85% ] 47/50 VUs  3m23.0s/4m00.0s

running (3m24.0s), 47/50 VUs, 4317 complete and 0 interrupted iterations
ramp_writers   [  85% ] 47/50 VUs  3m24.0s/4m00.0s

running (3m25.0s), 48/50 VUs, 4363 complete and 0 interrupted iterations
ramp_writers   [  85% ] 48/50 VUs  3m25.0s/4m00.0s

running (3m26.0s), 48/50 VUs, 4411 complete and 0 interrupted iterations
ramp_writers   [  86% ] 48/50 VUs  3m26.0s/4m00.0s

running (3m27.0s), 48/50 VUs, 4456 complete and 0 interrupted iterations
ramp_writers   [  86% ] 48/50 VUs  3m27.0s/4m00.0s

running (3m28.0s), 49/50 VUs, 4504 complete and 0 interrupted iterations
ramp_writers   [  87% ] 49/50 VUs  3m28.0s/4m00.0s

running (3m29.0s), 49/50 VUs, 4555 complete and 0 interrupted iterations
ramp_writers   [  87% ] 49/50 VUs  3m29.0s/4m00.0s

running (3m30.0s), 49/50 VUs, 4603 complete and 0 interrupted iterations
ramp_writers   [  87% ] 49/50 VUs  3m30.0s/4m00.0s

running (3m31.0s), 49/50 VUs, 4656 complete and 0 interrupted iterations
ramp_writers   [  88% ] 49/50 VUs  3m31.0s/4m00.0s

running (3m32.0s), 48/50 VUs, 4702 complete and 0 interrupted iterations
ramp_writers   [  88% ] 48/50 VUs  3m32.0s/4m00.0s

running (3m33.0s), 48/50 VUs, 4746 complete and 0 interrupted iterations
ramp_writers   [  89% ] 48/50 VUs  3m33.0s/4m00.0s

running (3m34.0s), 46/50 VUs, 4793 complete and 0 interrupted iterations
ramp_writers   [  89% ] 46/50 VUs  3m34.0s/4m00.0s

running (3m35.0s), 44/50 VUs, 4838 complete and 0 interrupted iterations
ramp_writers   [  90% ] 44/50 VUs  3m35.0s/4m00.0s

running (3m36.0s), 44/50 VUs, 4883 complete and 0 interrupted iterations
ramp_writers   [  90% ] 44/50 VUs  3m36.0s/4m00.0s

running (3m37.0s), 42/50 VUs, 4929 complete and 0 interrupted iterations
ramp_writers   [  90% ] 42/50 VUs  3m37.0s/4m00.0s

running (3m38.0s), 40/50 VUs, 4975 complete and 0 interrupted iterations
ramp_writers   [  91% ] 40/50 VUs  3m38.0s/4m00.0s

running (3m39.0s), 39/50 VUs, 5018 complete and 0 interrupted iterations
ramp_writers   [  91% ] 39/50 VUs  3m39.0s/4m00.0s

running (3m40.0s), 38/50 VUs, 5060 complete and 0 interrupted iterations
ramp_writers   [  92% ] 38/50 VUs  3m40.0s/4m00.0s

running (3m41.0s), 37/50 VUs, 5100 complete and 0 interrupted iterations
ramp_writers   [  92% ] 37/50 VUs  3m41.0s/4m00.0s

running (3m42.0s), 35/50 VUs, 5141 complete and 0 interrupted iterations
ramp_writers   [  92% ] 35/50 VUs  3m42.0s/4m00.0s

running (3m43.0s), 33/50 VUs, 5178 complete and 0 interrupted iterations
ramp_writers   [  93% ] 33/50 VUs  3m43.0s/4m00.0s

running (3m44.0s), 33/50 VUs, 5211 complete and 0 interrupted iterations
ramp_writers   [  93% ] 33/50 VUs  3m44.0s/4m00.0s

running (3m45.0s), 32/50 VUs, 5222 complete and 0 interrupted iterations
ramp_writers   [  94% ] 32/50 VUs  3m45.0s/4m00.0s

running (3m46.0s), 30/50 VUs, 5255 complete and 0 interrupted iterations
ramp_writers   [  94% ] 30/50 VUs  3m46.0s/4m00.0s

running (3m47.0s), 28/50 VUs, 5288 complete and 0 interrupted iterations
ramp_writers   [  95% ] 28/50 VUs  3m47.0s/4m00.0s

running (3m48.0s), 27/50 VUs, 5318 complete and 0 interrupted iterations
ramp_writers   [  95% ] 27/50 VUs  3m48.0s/4m00.0s

running (3m49.0s), 26/50 VUs, 5346 complete and 0 interrupted iterations
ramp_writers   [  95% ] 26/50 VUs  3m49.0s/4m00.0s

running (3m50.0s), 24/50 VUs, 5375 complete and 0 interrupted iterations
ramp_writers   [  96% ] 24/50 VUs  3m50.0s/4m00.0s

running (3m51.0s), 24/50 VUs, 5404 complete and 0 interrupted iterations
ramp_writers   [  96% ] 24/50 VUs  3m51.0s/4m00.0s

running (3m52.0s), 22/50 VUs, 5433 complete and 0 interrupted iterations
ramp_writers   [  97% ] 22/50 VUs  3m52.0s/4m00.0s

running (3m53.0s), 21/50 VUs, 5457 complete and 0 interrupted iterations
ramp_writers   [  97% ] 21/50 VUs  3m53.0s/4m00.0s

running (3m54.0s), 19/50 VUs, 5483 complete and 0 interrupted iterations
ramp_writers   [  97% ] 19/50 VUs  3m54.0s/4m00.0s

running (3m55.0s), 18/50 VUs, 5505 complete and 0 interrupted iterations
ramp_writers   [  98% ] 18/50 VUs  3m55.0s/4m00.0s

running (3m56.0s), 17/50 VUs, 5528 complete and 0 interrupted iterations
ramp_writers   [  98% ] 17/50 VUs  3m56.0s/4m00.0s

running (3m57.0s), 15/50 VUs, 5545 complete and 0 interrupted iterations
ramp_writers   [  99% ] 15/50 VUs  3m57.0s/4m00.0s

running (3m58.0s), 14/50 VUs, 5562 complete and 0 interrupted iterations
ramp_writers   [  99% ] 14/50 VUs  3m58.0s/4m00.0s

running (3m59.0s), 13/50 VUs, 5580 complete and 0 interrupted iterations
ramp_writers   [ 100% ] 13/50 VUs  3m59.0s/4m00.0s

running (4m00.0s), 11/50 VUs, 5598 complete and 0 interrupted iterations
ramp_writers   [ 100% ] 11/50 VUs  4m00.0s/4m00.0s


  █ THRESHOLDS 

    write_latency
    ✓ 'p(95)<5000' p(95)=640.62ms


  █ TOTAL RESULTS 

    checks_total.......: 11218   46.607341/s
    checks_succeeded...: 100.00% 11218 out of 11218
    checks_failed......: 0.00%   0 out of 11218

    ✓ write succeeded
    ✓ no rate limit

    CUSTOM
    comments_submitted.............: 5609   23.303671/s
    write_errors...................: 0.00%  0 out of 5609
    write_latency..................: avg=425.3ms  min=145.08ms med=404.12ms max=1.57s p(90)=571.66ms p(95)=640.62ms

    HTTP
    http_req_duration..............: avg=425.3ms  min=145.08ms med=404.12ms max=1.57s p(90)=571.66ms p(95)=640.62ms
      { expected_response:true }...: avg=425.3ms  min=145.08ms med=404.12ms max=1.57s p(90)=571.66ms p(95)=640.62ms
    http_req_failed................: 0.00%  0 out of 5609
    http_reqs......................: 5609   23.303671/s

    EXECUTION
    iteration_duration.............: avg=927.01ms min=465.35ms med=914.27ms max=2.22s p(90)=1.14s    p(95)=1.22s   
    iterations.....................: 5609   23.303671/s
    vus............................: 11     min=1         max=49
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 2.1 MB 8.7 kB/s
    data_sent......................: 1.4 MB 5.9 kB/s



running (4m00.7s), 00/50 VUs, 5609 complete and 0 interrupted iterations
ramp_writers ✓ [ 100% ] 00/50 VUs  4m0s